Revit 2027 API
BuiltInFailures.SketchFailures.CannotChangeUserSketchPlane Property
 Can't change plane of [Element Name] Sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotChangeUserSketchPlane { get; }
Public Shared ReadOnly Property CannotChangeUserSketchPlane As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotChangeUserSketchPlane {
	FailureDefinitionId^ get ();
}
static member CannotChangeUserSketchPlane : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace